say 'Hello world'
say "Bye World"
say "Enter first number: "
pull number1
say "Enter second number: "
pull number2
sum = number1 + number2
say "Sum of the two numbers is" sum "."
say "Sum of "number1" and" number2 "is" sum "."